app/views/rule_groups/_form.html.erb

SELECT "games".* FROM "games"
---
    <%= f.label :game_id %><br>
    <%= collection_select(:rule_group, :game_id, Game.all, :id, :name) %>