app/views/home/_smackdown_rules.html.erb

      <% smackdown=locals[:smackdown] %>
      <img class="resizable_image" src="<%= smackdown.smackdown_rules.first.rule.rule_group.game.image_path.split('.')[0] %>_100.png"/>
---
SELECT "rules".* FROM "rules" WHERE "rules"."id" = ? ORDER BY "rules"."id" ASC LIMIT 1  [["id", 3]]
SELECT "smackdown_rules".* FROM "smackdown_rules" WHERE "smackdown_rules"."smackdown_id" = ?  [["smackdown_id", 1]]