app/views/home/_smackdown_info.html.erb

<% if smackdown != nil %>
  <%= vsTable(User.find_by_id(smackdown.player1_id),User.find_by_id(smackdown.player2_id)).html_safe %>
  <img class="resizable_image" src="<%= smackdown.smackdown_rules.first.rule.rule_group.game.image_path %>"/>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "smackdowns".* FROM "smackdowns" ORDER BY created_at desc LIMIT 5