app/views/home/index.html.erb

  <% if current_user %>
    <% Game.all.each do |g| %>
      <% upg = UserPlayingGame.where(:user_id=>current_user.id, :game_id=>g.id)[0] %>
---
SELECT "games".* FROM "games"
SELECT "user_playing_games".* FROM "user_playing_games" WHERE "user_playing_games"."user_id" = 1 AND "user_playing_games"."game_id" = 1

        </h2>
        <% g.rule_groups.each do |rule_group| %>
---
SELECT "rules".* FROM "rules" WHERE "rules"."rule_group_id" = ?  [["rule_group_id", 1]]

              <td><%= rule.name %></td>
              <% player_rule = PlayerRule.where(:user_id=>current_user.id, :rule_id=>rule.id)[0] %>
---
SELECT "player_rules".* FROM "player_rules" WHERE "player_rules"."user_id" = 1 AND "player_rules"."rule_id" = 1

  </tr>
  <% User.all.each do |user| %>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1

  </tr>
  <% Smackdown.where(:player1_id=>current_user.id).each do |smackdown| %>
---
SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."player1_id" = 1

      <td>
        <%= User.find_by_id(smackdown.player2_id).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  </tr>
  <% Smackdown.where(:player2_id=>current_user.id).each do |smackdown| %>
---
SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."player2_id" = 1

  </tr>
  <% Smackdown.where(:judge1_id=>current_user.id).each do |smackdown| %>
---
SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."judge1_id" = 1


  <% Smackdown.where(:judge2_id=>current_user.id).each do |smackdown| %>
---
SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."judge2_id" = 1