app/views/home/pending_judge_smackdowns.html.erb


<% Smackdown.where(:judge2_id=>current_user.id, :judge2_accepted => nil).each do |smackdown| %>
---
SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."judge2_id" = 1 AND "smackdowns"."judge2_accepted" IS NULL