app/views/home/profile.html.erb

<%if @games_played%>
  <%@games_played["response"]["games"].each do |game|%>
---
SELECT "games".* FROM "games"

      <%Game.all.each do |game|%>
        <% upg = UserPlayingGame.where(:user_id=>current_user.id, :game_id=>game.id)[0] %>
---
SELECT "user_playing_games".* FROM "user_playing_games" WHERE "user_playing_games"."user_id" = 1 AND "user_playing_games"."game_id" = 1

              <%=form_tag "/home/set_rules", method: :post do%>
                <% game.rule_groups.each do |rule_group| %>
---
SELECT "rule_groups".* FROM "rule_groups" WHERE "rule_groups"."game_id" = ?  [["game_id", 1]]
SELECT "rules".* FROM "rules" WHERE "rules"."rule_group_id" = ?  [["rule_group_id", 1]]

                  <% rule_group.rules.each do |rule| %>
                    <% player_rule = PlayerRule.where(:user_id=>current_user.id, :rule_id=>rule.id)[0] %>
---
SELECT "player_rules".* FROM "player_rules" WHERE "player_rules"."user_id" = 1 AND "player_rules"."rule_id" = 1