app/views/home/send_smackdown.html.erb

SELECT "rules".* FROM "rules" WHERE "rules"."id" = 3 LIMIT 1
---
<% params["rule"].each do |rule| %>
  <p><%= Rule.find_by_id(rule[1]).name %></p>

SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---

<p>Juez: <%= User.find_by_id(params["judge_id"]).name %></p>