app/views/home/users.html.erb

<table>
  <% User.all.each do |user| %>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1