app/views/home/visit.html.erb

<% user = User.find_by_id(params[:id].to_i) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1


<% Smackdown.where(:player1_id=>current_user.id, :player2_id=>user.id).each do |smackdown| %>
---
SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."player2_id" = 1 AND "smackdowns"."player1_id" = 1


<% Game.all.each do |game| %>
---
SELECT "games".* FROM "games"

      <% rules_ok = true %>
      <% game.rule_groups.each do |rule_group| %>
---
SELECT "rule_groups".* FROM "rule_groups" WHERE "rule_groups"."game_id" = ?  [["game_id", 1]]
SELECT "rules".* FROM "rules" WHERE "rules"."rule_group_id" = ?  [["rule_group_id", 1]]

          <% rule_group.rules.each do |rule| %>
            <% if PlayerRule.where(:user_id=>user.id,:rule_id=>rule.id,:activated=>true)[0]!=nil %>
---
SELECT "player_rules".* FROM "player_rules" WHERE "player_rules"."user_id" = 1 AND "player_rules"."rule_id" = 1 AND "player_rules"."activated" = 't'

        <select name="judge_id">
          <% User.all.each do |judge| %>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1