app/views/home/visit.html.erb

<% i=0 %>
<% MetaImage.all.each do |meta_image| %>
---
SELECT "meta_images".* FROM "meta_images"