app/views/home/wating_opponent.html.erb

SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."player1_id" = 1 AND "smackdowns"."player2_accepted" IS NULL
---
<hr>
<% Smackdown.where(:player1_id=>current_user.id).where(:player2_accepted=>nil).each do |smackdown| %>