app/views/smackdown_creator/select_game.html.erb


<% Game.all.each do |game| %>
---
SELECT "games".* FROM "games"