app/views/smackdown_creator/select_user.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
      <tbody>
        <% User.all.each do |user| %>