app/controllers/games_controller.rb

  def index
    if !userIsAdmin
      redirect_to "/"
      return
    end
    @games = Game.all
---
SELECT "games".* FROM "games"

  def create
    if !userIsAdmin
      redirect_to "/"
      return
    end

    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 15 Jul 2014 05:20:45 UTC +00:00], ["name", "Ultra Street Fighter 4"], ["updated_at", Tue, 15 Jul 2014 05:20:45 UTC +00:00]]

    def set_game
      @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]