app/controllers/home_controller.rb

SELECT "rules".* FROM "rules" WHERE "rules"."id" = 3 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
---
  def send_smackdown
    judge1_id = params["judge_id"]
    player2_id = params["opponent_id"]
    game = Rule.find_by_id(params["rule"].first.second).rule_group.game
    player2 = User.find_by_id(player2_id)

INSERT INTO "smackdowns" ("created_at", "judge1_id", "player1_id", "player2_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 15 Jul 2014 05:23:02 UTC +00:00], ["judge1_id", 3], ["player1_id", 1], ["player2_id", 1], ["updated_at", Tue, 15 Jul 2014 05:23:02 UTC +00:00]]
---
    smackdown.player1_id = current_user.id
    smackdown.player2_id = player2_id

    smackdown.save

INSERT INTO "smackdown_rules" ("created_at", "rule_id", "smackdown_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 15 Jul 2014 05:23:02 UTC +00:00], ["rule_id", 3], ["smackdown_id", 1], ["updated_at", Tue, 15 Jul 2014 05:23:02 UTC +00:00]]
---
      smackdown_rule = SmackdownRule.new
      smackdown_rule.smackdown_id = smackdown.id
      smackdown_rule.rule_id = rule_id
      smackdown_rule.save

SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."player1_id" = 1
SELECT COUNT(*) FROM "smackdowns" WHERE "smackdowns"."player1_id" = 1
---
  def history_sent_smackdowns
    @smackdowns = Smackdown.where(:player1_id=>current_user.id).paginate(:page => params[:page], :per_page => 5)

SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."player2_id" = 1 AND "smackdowns"."player2_accepted" IN ('t', 'f')
SELECT COUNT(*) FROM "smackdowns" WHERE "smackdowns"."player2_id" = 1 AND "smackdowns"."player2_accepted" IN ('t', 'f')
---
  def history_received_smackdowns
    @smackdowns = Smackdown.where(:player2_id=>current_user.id, :player2_accepted=>[true,false]).paginate(:page => params[:page], :per_page => 5)

SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."judge1_id" = 1 AND "smackdowns"."judge1_accepted" IN ('t', 'f')
SELECT COUNT(*) FROM "smackdowns" WHERE "smackdowns"."judge1_id" = 1 AND "smackdowns"."judge1_accepted" IS NULL
---
  def history_judged_smackdowns
    @judge_smackdowns = Smackdown.where("(judge1_id = ? AND (judge1_accepted = ? OR judge1_accepted = ?)) OR (judge1_id = ? AND (judge1_accepted = ? OR judge1_accepted = ?))", current_user.id,true,false,current_user.id,true,false).paginate(:page => params[:page], :per_page => 5)

SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."player2_id" = 1 AND "smackdowns"."player2_accepted" IS NULL
---
  def pending_respond_smackdowns
    @smackdowns = Smackdown.where(:player2_id=>current_user.id, :player2_accepted=>nil)

SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."judge1_id" = 1 AND "smackdowns"."judge1_accepted" IS NULL
SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."judge2_id" = 1 AND "smackdowns"."judge2_accepted" IS NULL
---
  def pending_judge_smackdowns
    @judge1_smackdowns = Smackdown.where(:judge1_id=>current_user.id, :judge1_accepted => nil)
    @judge2_smackdowns = []
    Smackdown.where(:judge2_id=>current_user.id, :judge2_accepted => nil).each do |smackdown|

SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."player1_id" = 1 AND "smackdowns"."player2_accepted" IS NULL
---
  def wating_opponent
    @smackdowns = Smackdown.where(:player1_id=>current_user.id).where(:player2_accepted=>nil)

SELECT "smackdowns".* FROM "smackdowns" WHERE (("smackdowns"."player1_id" = 1 OR "smackdowns"."player2_id" = 1)) AND (smackdowns.judge1_id != smackdowns.judge2_id) AND (("smackdowns"."judge1_accepted" IS NULL OR "smackdowns"."judge2_accepted" IS NULL))
---
  def wating_judges
    smackdown_table = Smackdown.arel_table
    user_smackdowns=Smackdown.where(smackdown_table[:player1_id].eq(current_user.id).or(smackdown_table[:player2_id].eq(current_user.id)))
    different_judges = user_smackdowns.where("smackdowns.judge1_id != smackdowns.judge2_id").where(smackdown_table[:judge1_accepted].eq(nil).or(smackdown_table[:judge2_accepted].eq(nil)))

SELECT "rules".* FROM "rules" WHERE "rules"."id" = ? ORDER BY "rules"."id" ASC LIMIT 1  [["id", 3]]
---
  def set_rules
    player_rules=params["player_rules"]
    player_rules.each do |player_rule_params|
      player_rule = PlayerRule.find_by_id(player_rule_params.first)