app/controllers/home_controller.rb

  def history_judged_smackdowns
    @judge_smackdowns = Smackdown.where(:judge1_id=>current_user.id, :judge1_accepted => [true,false])
    Smackdown.where(:judge2_id=>current_user.id, :judge2_accepted => [true,false]).each do |smackdown|
---
SELECT "smackdowns".* FROM "smackdowns" WHERE "smackdowns"."judge2_id" = 1 AND "smackdowns"."judge2_accepted" IN ('t', 'f')