app/controllers/player_rules_controller.rb

  def index
    @player_rules = PlayerRule.all
---
SELECT "player_rules".* FROM "player_rules"

  def create
    @player_rule = PlayerRule.new(player_rule_params)

    respond_to do |format|
      if @player_rule.save
---
INSERT INTO "player_rules" ("activated", "created_at", "rule_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["activated", true], ["created_at", Tue, 15 Jul 2014 05:22:43 UTC +00:00], ["rule_id", 1], ["updated_at", Tue, 15 Jul 2014 05:22:43 UTC +00:00], ["user_id", 1]]

  def update
    new_activated = !@player_rule.activated
    respond_to do |format|
      if @player_rule.update(player_rule_params)
---
UPDATE "player_rules" SET "activated" = ?, "updated_at" = ? WHERE "player_rules"."id" = 4  [["activated", false], ["updated_at", Tue, 15 Jul 2014 05:49:06 UTC +00:00]]

    def set_player_rule
      @player_rule = PlayerRule.find(params[:id])
---
SELECT "player_rules".* FROM "player_rules" WHERE "player_rules"."id" = ? LIMIT 1  [["id", "4"]]