app/controllers/rule_groups_controller.rb

  def index
    @rule_groups = RuleGroup.all
---
SELECT "rule_groups".* FROM "rule_groups"

  def create
    @rule_group = RuleGroup.new(rule_group_params)

    respond_to do |format|
      if @rule_group.save
---
INSERT INTO "rule_groups" ("created_at", "game_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 15 Jul 2014 05:21:14 UTC +00:00], ["game_id", 1], ["name", "Game mode"], ["updated_at", Tue, 15 Jul 2014 05:21:14 UTC +00:00]]

    def set_rule_group
      @rule_group = RuleGroup.find(params[:id])
---
SELECT "rule_groups".* FROM "rule_groups" WHERE "rule_groups"."id" = ? LIMIT 1  [["id", "1"]]