app/controllers/rules_controller.rb

  def index
    if !userIsAdmin
      redirect_to "/"
      return
    end

    @rules = Rule.all
---
SELECT "rules".* FROM "rules"

  def create
    if !userIsAdmin
      redirect_to "/"
      return
    end

    @rule = Rule.new(rule_params)

    respond_to do |format|
      if @rule.save
---
INSERT INTO "rules" ("created_at", "name", "rule_group_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 15 Jul 2014 05:21:55 UTC +00:00], ["name", "3/5"], ["rule_group_id", 1], ["updated_at", Tue, 15 Jul 2014 05:21:55 UTC +00:00]]

    def set_rule
      @rule = Rule.find(params[:id])
---
SELECT "rules".* FROM "rules" WHERE "rules"."id" = ? LIMIT 1  [["id", "1"]]