app/controllers/smackdown_creator_controller.rb

  def select_game
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]