app/controllers/user_playing_games_controller.rb

SELECT "user_playing_games".* FROM "user_playing_games"
---
  def index
    if !userIsAdmin
      redirect_to "/"
      return
    end

    @user_playing_games = UserPlayingGame.all

INSERT INTO "user_playing_games" ("created_at", "game_id", "is_playing", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 15 Jul 2014 05:22:37 UTC +00:00], ["game_id", 1], ["is_playing", true], ["updated_at", Tue, 15 Jul 2014 05:22:37 UTC +00:00], ["user_id", 1]]
---
  def create
    if !userIsAdmin
      redirect_to "/"
      return
    end

    @user_playing_game = UserPlayingGame.new(user_playing_game_params)

    respond_to do |format|
      if @user_playing_game.save

UPDATE "user_playing_games" SET "user_id" = ?, "game_id" = ?, "is_playing" = ?, "updated_at" = ? WHERE "user_playing_games"."id" = 6  [["user_id", 1], ["game_id", 3], ["is_playing", true], ["updated_at", Fri, 20 Feb 2015 00:49:07 UTC +00:00]]
---
  def update
    if !userIsAdmin
      redirect_to "/"
      return
    end

    new_is_playing = !@user_playing_game.is_playing
    respond_to do |format|
      if @user_playing_game.update(user_playing_game_params)

SELECT "user_playing_games".* FROM "user_playing_games" WHERE "user_playing_games"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_user_playing_game
      @user_playing_game = UserPlayingGame.find(params[:id])