app/views/rules/_form.html.erb

    <%= f.label :rule_group_id %><br>
    <%= collection_select(:rule, :rule_group_id, RuleGroup.all, :id, :name) %>
---
SELECT "rule_groups".* FROM "rule_groups"